{"company":[{"id":"4","name":"3Scale","summary":"3Scale provides plug-and-play as well as enterprise level API management services. 3Scale is similar to 3Scale connect is a starter platform with a freemium model for delivering your API. You can deploy at no cost, and pay-as-you-go based upon the volume of calls made on your API. This model is well suited to those who are not sure of their API business model or target audience &mdash; or are just","details":"3Scale provides plug-and-play as well as enterprise level API management services. 3Scale is similar to 3Scale connect is a starter platform with a freemium model for delivering your API. You can deploy at no cost, and pay-as-you-go based upon the volume of calls made on your API. This model is well suited to those who are not sure of their API business model or target audience &mdash; or are just looking to test the waters.","website":"http:\/\/www.3scale.net","twitter":"https:\/\/twitter.com\/3scale","github":"https:\/\/github.com\/3scale","blog":"http:\/\/www.3scale.net\/blog\/","blogrss":"view-source:http:\/\/www.3scale.net\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/3scale-logo.jpg","logo_width":"275","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/3287_3scale_service_management.png","tags":"API Management"},{"id":"25","name":"Apify","summary":"Apify is a small and powerful open source library that delivers new levels of developer productivity by simplifying the creation of RESTful architectures. It helps development teams deliver quality web services and applications in reduced amounts of time. Web services are a great way to extend your application, however, adding a web API to an existing web application can be a tedious and time-cons","details":"Apify is a small and powerful open source library that delivers new levels of developer productivity by simplifying the creation of RESTful architectures. It helps development teams deliver quality web services and applications in reduced amounts of time. Web services are a great way to extend your application, however, adding a web API to an existing web application can be a tedious and time-consuming task. Apify takes certain common patterns found in most web services and abstract them so that you can quickly write web APIs without having to write too much code.","website":"http:\/\/www.apifydoc.com\/","twitter":"https:\/\/twitter.com\/api_fy","github":"https:\/\/github.com\/apify","blog":"","blogrss":"http:\/\/www.apifydoc.com\/posts\/recent.rss","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/apify-logo.png","logo_width":"200","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Apify-Screenshot.png","tags":"API Management"},{"id":"90","name":"APISpark","summary":"APISpark is an cloud API platform that lets you create, host, manage and use web APIs. Using the Restlet Framework at its core, APISpark simplifies the web API experience, the time to market, and the overall cost to get started and to scale you APIs. Restlet is a web API platform vendor, pioneer of RESTful web APIs. APISpark serves our customers around the world, providing software to build web AP","details":"APISpark is an cloud API platform that lets you create, host, manage and use web APIs. Using the Restlet Framework at its core, APISpark simplifies the web API experience, the time to market, and the overall cost to get started and to scale you APIs. Restlet is a web API platform vendor, pioneer of RESTful web APIs. APISpark serves our customers around the world, providing software to build web APIs, which includes APISpark, the PaaS version of Restlet. APISpark lets you build and deploy your web APIs, which includes the creation, hosting and management--all in one solution.","website":"https:\/\/apispark.com\/","twitter":"https:\/\/twitter.com\/apispark","github":"https:\/\/github.com\/apispark","blog":"http:\/\/blog.restlet.com\/","blogrss":"http:\/\/blog.restlet.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/APISpark-Logo.png","logo_width":"0","screenshot":null,"tags":"API Deployment,API Management,API-Deployment"},{"id":"31","name":"Azure","summary":"Simple and frictionless access for developers is key to the success of any API program. Minimizing the time it takes for a new developer to complete a transaction with your API is crucial. API Management generates great documentation and provides an interactive console that rapidly increases developer success.","details":"Simple and frictionless access for developers is key to the success of any API program. Minimizing the time it takes for a new developer to complete a transaction with your API is crucial. API Management generates great documentation and provides an interactive console that rapidly increases developer success.","website":"http:\/\/azure.microsoft.com\/en-us\/services\/api-management\/","twitter":"https:\/\/twitter.com\/azure","github":"","blog":"http:\/\/azure.microsoft.com\/blog\/","blogrss":"http:\/\/azure.microsoft.com\/blog\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/microsoft-azure-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/6443_apiphany.png","tags":"API Management"},{"id":"125","name":"APIAxle","summary":"ApiAxle is a proxy that sits on your network, in front of your API(s) and manages things that you shouldn't have to, like rate limiting, authentication and caching. It's fast, open and easy to configure. ApiAxle is different to the cloud based services such as Mashery in that it&rsquo;s intended to be installed within your LAN and be managed by you. This means you own your users, you own your data","details":"ApiAxle is a proxy that sits on your network, in front of your API(s) and manages things that you shouldn't have to, like rate limiting, authentication and caching. It's fast, open and easy to configure. ApiAxle is different to the cloud based services such as Mashery in that it&rsquo;s intended to be installed within your LAN and be managed by you. This means you own your users, you own your data and you can more easily manage costs. ApiAxle is open-source. This means you can modify it as much as you like and contribute changes back. Others will do the same and gradually the system will become all the better for it.","website":"http:\/\/apiaxle.com\/","twitter":"https:\/\/twitter.com\/apiaxle","github":"https:\/\/github.com\/apiaxle","blog":"http:\/\/blog.apiaxle.com\/","blogrss":"http:\/\/blog.apiaxle.com\/feed.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/api-axle-logo.png","logo_width":"175","screenshot":null,"tags":"API Deployment,API Management"},{"id":"3","name":"Apigee","summary":"Apigee is a provider of API technology and services for enterprises and developers. Providing a range of solutions from entry level tools for exploring APIs with a console and navigating OAuth, to enterprise tools for managing OAuth, Keys and platform for driving developer adoption while understanding usage, managing traffic and scaling an API platform. Apigee provides solutions for enterprises li","details":"Apigee is a provider of API technology and services for enterprises and developers. Providing a range of solutions from entry level tools for exploring APIs with a console and navigating OAuth, to enterprise tools for managing OAuth, Keys and platform for driving developer adoption while understanding usage, managing traffic and scaling an API platform. Apigee provides solutions for enterprises like Comcast, GameSpy, TransUnion Interactive, Guardian Life and Constant Contact and thousands of developers use Apigee's technology.\nApigee provides resources to help you understand best practices, avoid common pitfalls, develop your strategy, and learn to drive your developer community. Apigee also provides articles, white papers, and other resources to help you deliver your API.","website":"https:\/\/apigee.com","twitter":"https:\/\/twitter.com\/Apigee","github":"https:\/\/github.com\/apigee","blog":"https:\/\/blog.apigee.com\/front","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/apigee-logo.gif","logo_width":"175","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/3341_apigee_oauth.png","tags":"API Deployment,API Discovery,API Gateway,API Management,Apigee,Authentication,BaaS,Security,Utility"},{"id":"1916","name":"API Metrics","summary":"APImetrics builds on 3 years experience gained working on the challenge of API abstraction and management that is critical to every App and Web Service in use today. By combining elements gained from API management tools and authentication technologies, APImetrics have been able to build the first, complete, end-to-end API performance test solution. This allows developers, enterprises and API prov","details":"APImetrics builds on 3 years experience gained working on the challenge of API abstraction and management that is critical to every App and Web Service in use today. By combining elements gained from API management tools and authentication technologies, APImetrics have been able to build the first, complete, end-to-end API performance test solution. This allows developers, enterprises and API providers to model complex API scenarios and provide them with real time monitoring and alerts when things go wrong.","website":"http:\/\/apimetrics.io","twitter":"https:\/\/twitter.com\/apimetricstats","github":"","blog":"http:\/\/apimetrics.io\/blog\/","blogrss":"http:\/\/apimetrics.io\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/api-metrics-logo.png","logo_width":"150","screenshot":null,"tags":"Analytics,API Integration,API Management,Metrics"},{"id":"91","name":"Exicon","summary":"Exicon is the AppCycle management company that simplifies the creation, deployment and management of mobile applications for some of the world's biggest companies allowing them to accelerate their success in mobile.\nThrough its proprietary AppCycle Management platform, Exicon provides the services and tools to support customers in defining their application needs, finding the best developers, stor","details":"Exicon is the AppCycle management company that simplifies the creation, deployment and management of mobile applications for some of the world's biggest companies allowing them to accelerate their success in mobile.\nThrough its proprietary AppCycle Management platform, Exicon provides the services and tools to support customers in defining their application needs, finding the best developers, storing all components of the applications, reaching the end users for your application and measuring its performance.","website":"https:\/\/twitter.com\/","twitter":"https:\/\/twitter.com\/exicon","github":"","blog":"http:\/\/www.exiconglobal.com\/blog\/","blogrss":"http:\/\/feeds.feedburner.com\/ExiconBlog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/exicon-logo.png","logo_width":"200","screenshot":null,"tags":"API Management,Application Management"},{"id":"1784","name":"IBM","summary":"IBM&reg; API Management solution provides a complete set of web API capabilities to help you extend services from the back-office to new front-office engagements. It offers flexible deployment options, including capabilities for creating, proxying, assembling, securing, and scaling web APIs. IBM API Management provides detailed analytics and operational metrics to the business owner, as well as a ","details":"IBM&reg; API Management solution provides a complete set of web API capabilities to help you extend services from the back-office to new front-office engagements. It offers flexible deployment options, including capabilities for creating, proxying, assembling, securing, and scaling web APIs. IBM API Management provides detailed analytics and operational metrics to the business owner, as well as a customized developer portal for socializing the APIs and managing applications that can be used by developers.","website":"http:\/\/www-03.ibm.com\/software\/products\/us\/en\/api-management\/","twitter":"https:\/\/twitter.com\/IBM","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/bw-ibm-logo.jpeg","logo_width":"200","screenshot":null,"tags":"API Management"},{"id":"8","name":"Layer 7 Technologies","summary":"Layer 7 is a leading provider of API security and governance for Service Oriented, Web Oriented and Cloud Oriented integration. Through our award winning line of SecureSpan and CloudSpan family of API gateways and management products, Layer 7 is helping organizations control how they expose their data and applications to outside divisions, partners, mobile developers and cloud services.\nFounded in","details":"Layer 7 is a leading provider of API security and governance for Service Oriented, Web Oriented and Cloud Oriented integration. Through our award winning line of SecureSpan and CloudSpan family of API gateways and management products, Layer 7 is helping organizations control how they expose their data and applications to outside divisions, partners, mobile developers and cloud services.\nFounded in 2003, Layer 7 operates in the US, Canada and Europe. Our customers include leading insurance, banking, telecom and government organizations. The company is venture backed by leading Canadian and US investors.","website":"http:\/\/www.layer7tech.com\/","twitter":"https:\/\/twitter.com\/layer7","github":"https:\/\/github.com\/Layer7tech","blog":"http:\/\/www.layer7tech.com\/blogs\/","blogrss":"http:\/\/www.layer7tech.com\/blogs\/index.php\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/layer7-logo.png","logo_width":"0","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/6334_apify.png","tags":"API Deployment,API Gateway,API Management,Layer7"},{"id":"1","name":"Mashery","summary":"Mashery&rsquo;s API management tools and strategic services help companies connect with customers and partners in a changing digital world by extending reach across devices, markets and the Web. Mashery leads the industry with a holistic approach for API initiatives &ndash; from setting platform strategy and measuring business objectives to the heavy lifting of providing and managing infrastructur","details":"Mashery&rsquo;s API management tools and strategic services help companies connect with customers and partners in a changing digital world by extending reach across devices, markets and the Web. Mashery leads the industry with a holistic approach for API initiatives &ndash; from setting platform strategy and measuring business objectives to the heavy lifting of providing and managing infrastructure to facilitating relationships with our 150,000 strong network of Web and mobile application developers. Having worked with over 100 leading brands to power more than 40,000 apps, Mashery&rsquo;s knowledge, experience and proven strategies enable companies to focus on their core business while driving sales, building new revenue channels and realizing faster time-to-market for innovative applications.","website":"http:\/\/mashery.com","twitter":"https:\/\/twitter.com\/Mashery","github":"https:\/\/github.com\/mashery","blog":"http:\/\/www.mashery.com\/blog","blogrss":"http:\/\/feeds.feedburner.com\/MasheryBlog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/mashery-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Mashery-Screenshot.png","tags":"API Design,API Discovery,API Management"},{"id":"9","name":"Mashape","summary":"Mashape provides tools that enable developers to quickly deliver and consume APIs and offers a marketplace for listing APIs. Mashape provides tools for testing your API, code for generation of custom errors, components for user management and standardized API code language libraries in multiple languages. Once your API is ready for prime time Mashape provides a marketplace for listing your API, le","details":"Mashape provides tools that enable developers to quickly deliver and consume APIs and offers a marketplace for listing APIs. Mashape provides tools for testing your API, code for generation of custom errors, components for user management and standardized API code language libraries in multiple languages. Once your API is ready for prime time Mashape provides a marketplace for listing your API, letting developers to easily discover and begin hacking with your API, in a social API community environment.","website":"http:\/\/mashape.com","twitter":"https:\/\/twitter.com\/mashape","github":"https:\/\/github.com\/njvitto","blog":"http:\/\/blog.mashape.com\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/mashape-logo.png","logo_width":"175","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Mashape-Screenshot.png","tags":"API Directory,API Discovery,API Integration,API Management,API Operations"},{"id":"27","name":"Nevatech Sentinet","summary":"Nevatech Sentinet&trade; is a flexible, lightweight and scalable API management platform that promotes integration through the use of SOA standards. It is designed to connect, mediate, and manage interactions between services across the enterprise or in the cloud. If your organization uses internally or externally-facing web services and APIs, cloud-based infrastructure, or service-oriented archit","details":"Nevatech Sentinet&trade; is a flexible, lightweight and scalable API management platform that promotes integration through the use of SOA standards. It is designed to connect, mediate, and manage interactions between services across the enterprise or in the cloud. If your organization uses internally or externally-facing web services and APIs, cloud-based infrastructure, or service-oriented architecture for your applications, then you will find Sentinet to be a powerful tool, which can be deployed rapidly, and immediately start delivering tangible results.","website":"http:\/\/www.nevatech.com\/","twitter":"","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Nevatech-Logo.png","logo_width":"175","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Nevatech-Screenshot.png","tags":"API Management"},{"id":"1813","name":"Oracle","summary":"Secures service-oriented architecture (SOA) deployments on-premise, across domain boundaries, or in the cloud enabling organizations to securely and rapidly adopt cloud, mobile, and SOA services. Provides a lightweight API gateway for securing and managing APIs. Connects mobile devices to existing enterprise systems. Significantly lowers integration costs, decreases total cost of ownership, and re","details":"Secures service-oriented architecture (SOA) deployments on-premise, across domain boundaries, or in the cloud enabling organizations to securely and rapidly adopt cloud, mobile, and SOA services. Provides a lightweight API gateway for securing and managing APIs. Connects mobile devices to existing enterprise systems. Significantly lowers integration costs, decreases total cost of ownership, and reduces deployment risks. Offers rich integration with many identity and access management platforms. Helps streamline regulatory compliance through authentication, authorization, and audit capabilities.","website":"http:\/\/www.oracle.com\/us\/products\/middleware\/identity-management\/api-gateway\/overview\/index.html","twitter":"https:\/\/twitter.com\/OracleSOA","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/oracle-logo.jpg","logo_width":"0","screenshot":null,"tags":"API Deployment,API Gateway,API Management"},{"id":"20","name":"SOA Software","summary":"SOA Software, Inc. provides API management and integrated service-oriented architecture (SOA) governance automation solutions. It offers Enterprise API Management; Policy Manager, which provides SOA registry\/repository and SOA policy governance solutions; Repository Manager, which provides software development asset repository, lifecycle management, and metadata federation solutions; and Portfolio","details":"SOA Software, Inc. provides API management and integrated service-oriented architecture (SOA) governance automation solutions. It offers Enterprise API Management; Policy Manager, which provides SOA registry\/repository and SOA policy governance solutions; Repository Manager, which provides software development asset repository, lifecycle management, and metadata federation solutions; and Portfolio Manager, a planning governance product that helps ensure the alignment of SOA programs with strategic IT investment and business objectives. The company also provides Service Manager, a SOA management and security product, which provides security, routing, mediation, monitoring, and management for SOA and Web services; and SOLA, which provides a governable mainframe SOA platform.","website":"http:\/\/soa.com","twitter":"https:\/\/twitter.com\/SOASoftwareInc","github":"","blog":"http:\/\/blog.soa.com\/","blogrss":"http:\/\/feeds.feedburner.com\/SOA\/Blog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/soa-software-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Atmosphere-Screenshot.png","tags":"API Deployment,API Gateway,API Management,Enterprise,SOA Software"},{"id":"1361","name":"SlashDB","summary":"SlashDB connects your internal databases and constructs a REST\/HTTP web service, easily making database content accessible by URLs for getting, updating, inserting and deleting in a secure way. SlashDB provides connectors for Microsoft SQL Server, Oracle, MySQL, PostGreSQL, IBM DB2 and Sybase--covering the top 5 databases you will find in the enterprise or small to medium businesses.\nSlashDB autom","details":"SlashDB connects your internal databases and constructs a REST\/HTTP web service, easily making database content accessible by URLs for getting, updating, inserting and deleting in a secure way. SlashDB provides connectors for Microsoft SQL Server, Oracle, MySQL, PostGreSQL, IBM DB2 and Sybase--covering the top 5 databases you will find in the enterprise or small to medium businesses.\nSlashDB automatically turns databases into online resource so their  content becomes accessible to authorized web, mobile and enterprise  applications for reading and writing under standard data formats.  Technically speaking, it makes REST APIs out of relational databases.","website":"http:\/\/www.slashdb.com\/","twitter":"http:\/\/twitter.com\/slash_db","github":"","blog":"","blogrss":"http:\/\/www.slashdb.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/slashdb-logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/7335_slashdb.png","tags":"API Management,API-Deployment"},{"id":"24","name":"Socrata","summary":"Socrata is the leading developer and provider of Open Data Services, a category of cloud-based Web 2.0 solutions that enable federal, state, and local governments to dramatically improve the reach, usability and social utility of their public information assets. The Socrata Social Data Platform&trade; is a turnkey information delivery platform that reduces lifecycle management costs for government","details":"Socrata is the leading developer and provider of Open Data Services, a category of cloud-based Web 2.0 solutions that enable federal, state, and local governments to dramatically improve the reach, usability and social utility of their public information assets. The Socrata Social Data Platform&trade; is a turnkey information delivery platform that reduces lifecycle management costs for government customers while boosting their ability to disseminate relevant information and data-driven services to a wide range of audiences including citizens, civic application developers, researchers, journalists and internal stakeholders.","website":"http:\/\/socrata.com","twitter":"https:\/\/twitter.com\/socrata","github":"https:\/\/github.com\/socrata","blog":"http:\/\/www.socrata.com\/tech-blog\/","blogrss":"http:\/\/www.socrata.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/socrata_logo.jpg","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/1619_socrata_open_data_.png","tags":"API Management,City Government Services,County Government Services,Data,Data API Management,Federal Government Services,Socrata,State Government Services"},{"id":"1688","name":"SwiftIQ","summary":"SwiftIQ provides web-service application programming interface (API) infrastructure to facilitate data accessibility and predictive analytics through the Swift Access and Swift Predictions products. Swift Access is an award-winning backend platform to unify and secure disconnected data then deliver and analyze it on-demand to power real-time digital actions. Swift Predictions allows users to apply","details":"SwiftIQ provides web-service application programming interface (API) infrastructure to facilitate data accessibility and predictive analytics through the Swift Access and Swift Predictions products. Swift Access is an award-winning backend platform to unify and secure disconnected data then deliver and analyze it on-demand to power real-time digital actions. Swift Predictions allows users to apply adaptive, machine learning algorithms to discover insights fast and make applications smarter. The Company was founded in 2011 and headquartered in Chicago, IL.","website":"http:\/\/www.swiftiq.com\/","twitter":"https:\/\/twitter.com\/swiftiq","github":"https:\/\/github.com\/Storeplacer","blog":"http:\/\/www.swiftiq.com\/blog","blogrss":"http:\/\/www.swiftiq.com\/blog\/rss.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/swift-iq-logo.jpg","logo_width":"200","screenshot":null,"tags":"Adaptive Intelligence,API Management,API-Deployment,BaaS,E-commerce"},{"id":"372","name":"StrikeIron","summary":"StrikeIron is the leader in Data-as-a-Service (DaaS), delivering data quality and communications solutions via our cloud platform IronCloud. We provide address verification, email verification, phone validation, phone append, SMS text messaging, and sales tax solutions to customers in a variety of markets. Our solutions are delivered as Web services that can be easily integrated into any applicati","details":"StrikeIron is the leader in Data-as-a-Service (DaaS), delivering data quality and communications solutions via our cloud platform IronCloud. We provide address verification, email verification, phone validation, phone append, SMS text messaging, and sales tax solutions to customers in a variety of markets. Our solutions are delivered as Web services that can be easily integrated into any application or system. Additionally, our solutions are pre-integrated into leading platforms like: Salesforce.com, Magento, Informatica, Oracle CRM On-Demand, and more.","website":"http:\/\/www.strikeiron.com\/Catalog\/ProductDetail.aspx?pv=1.0.0&pn=Midnight+Trader+Financial+News","twitter":"https:\/\/twitter.com\/strikeiron","github":"","blog":"http:\/\/blog.strikeiron.com","blogrss":"http:\/\/blog.strikeiron.com\/CMS\/UI\/Modules\/BizBlogger\/rss.aspx","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/372_logo.png","logo_width":"150","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/6919_strikeiron_zip_and_postal_code_info.png","tags":"Address Verification,API Management,Business,Catalog,Census,Currency,Distance,Email,Enterprise,Exchange,Financial,Geocoding,Global,Government,Location,Location,Mapping,Mapping,Marketplace,Messaging,Money,News,Phone,Phone,Shopping,Stack,stocks,Travel,verification,Zip Code"},{"id":"21","name":"Vordel","summary":"Vordel API Gateway is a policy enforcement point to authenticate API clients and users against enterprise access management platforms. Vordel adds advanced capabilities such as security token mediation for single sign-on and identity federation. Vordel API Gateway also integrates with fine-grained authorization tools to externalize authorization for new and legacy applications. Vordel offers out-o","details":"Vordel API Gateway is a policy enforcement point to authenticate API clients and users against enterprise access management platforms. Vordel adds advanced capabilities such as security token mediation for single sign-on and identity federation. Vordel API Gateway also integrates with fine-grained authorization tools to externalize authorization for new and legacy applications. Vordel offers out-of-the-box integration with all the leading identity management platforms to provide comprehensive API Security.","website":"https:\/\/twitter.com\/dnsmadeeasy","twitter":"https:\/\/twitter.com\/vordel","github":"","blog":"http:\/\/resources.vordel.com\/index.php\/category\/blog\/","blogrss":"http:\/\/feeds.feedburner.com\/Vordelfeeds?format=xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Vordel-API-Management.png","logo_width":"0","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Vordel-Screenshot.png","tags":"API Deployment,API Gateway,API Management,Enterprise,Vordel"},{"id":"30","name":"WSO2","summary":"WSO2 is the lean enterprise middleware company. It delivers the only complete open source enterprise SOA middleware stack purpose-built as an integrated platform to support today&rsquo;s heterogeneous enterprise environments internally and in the cloud. WSO2&rsquo;s service and support team is led by technical experts who have proven success in deploying enterprise SOAs and contribute to the techn","details":"WSO2 is the lean enterprise middleware company. It delivers the only complete open source enterprise SOA middleware stack purpose-built as an integrated platform to support today&rsquo;s heterogeneous enterprise environments internally and in the cloud. WSO2&rsquo;s service and support team is led by technical experts who have proven success in deploying enterprise SOAs and contribute to the technology standards that enable them.","website":"http:\/\/wso2.com","twitter":"http:\/\/twitter.com\/wso2","github":"https:\/\/github.com\/wso2","blog":"http:\/\/wso2.com\/blogs\/thesource\/","blogrss":"http:\/\/wso2.com\/blogs\/thesource\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/wso2-logo-white-800X360.jpg","logo_width":"200","screenshot":null,"tags":"API Management,BaaS"},{"id":"2245","name":"MuleSoft","summary":"MuleSoft provides the most widely used integration platform for connecting SaaS and enterprise applications in the cloud and on-premise. With the rise of cloud and mobile, enterprises face a choice: get overwhelmed by the resulting explosion of end points or seize the opportunity to gain competitive advantage. Founded on the idea that connecting applications should not be hard, MuleSoft lets organ","details":"MuleSoft provides the most widely used integration platform for connecting SaaS and enterprise applications in the cloud and on-premise. With the rise of cloud and mobile, enterprises face a choice: get overwhelmed by the resulting explosion of end points or seize the opportunity to gain competitive advantage. Founded on the idea that connecting applications should not be hard, MuleSoft lets organizations harness the power of their applications through integration. MuleSoft&rsquo;s Anypoint&trade; technology eliminates costly, time-intensive point-to-point integration, enabling business agility. Delivered as a packaged integration experience, CloudHub&trade; and Mule ESB&trade; (Enterprise Service Bus) are built on proven open source technology for the fastest, most reliable on-premise and cloud integration without vendor lock-in.","website":"http:\/\/www.mulesoft.com\/","twitter":"https:\/\/twitter.com\/MuleSoft","github":"","blog":"http:\/\/blogs.mulesoft.org\/","blogrss":"http:\/\/feeds.feedburner.com\/muleblog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/mulesoft-logo.jpeg","logo_width":"150","screenshot":null,"tags":"API Deployment,API Design,API Management"},{"id":"2650","name":"Flynn","summary":"The product that ops provides to developers. Ops should be a product team, not consultants. Flynn is the single platform that ops can provide to developers to power production, testing, and development, freeing developers to focus.","details":"The product that ops provides to developers. Ops should be a product team, not consultants. Flynn is the single platform that ops can provide to developers to power production, testing, and development, freeing developers to focus.","website":"https:\/\/flynn.io\/","twitter":"","github":"https:\/\/github.com\/flynn","blog":"https:\/\/flynn.io\/blog","blogrss":"https:\/\/flynn.io\/blog.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/flynn-logo.png","logo_width":"150","screenshot":null,"tags":"API Deployment,API Management"},{"id":"2959","name":"StrongLoop","summary":"StrongLoop is based in San Mateo, CA and employs over 30 developers working with Node.js. StrongLoop develops StrongLoop Suite, a leading Mobile API Tier along with being the primary code contributor to Node.js. StrongLoop Suite includes an open source private mBaaS, an operations console and a supported package of Node.js, containing advanced debugging, clustering and support for private npm regi","details":"StrongLoop is based in San Mateo, CA and employs over 30 developers working with Node.js. StrongLoop develops StrongLoop Suite, a leading Mobile API Tier along with being the primary code contributor to Node.js. StrongLoop Suite includes an open source private mBaaS, an operations console and a supported package of Node.js, containing advanced debugging, clustering and support for private npm registries. StrongLoop was founded by Node core-contributors, Enterprise mobile architects and veterans of open source and Could companies. StrongLoop is backed by Ignition Partners and Shasta Ventures and includes Marten Mickos, CEO of Eucalyptus (previously MySQL) as an advisor.","website":"http:\/\/strongloop.com\/","twitter":"https:\/\/twitter.com\/StrongLoop","github":"https:\/\/github.com\/strongloop","blog":"http:\/\/strongloop.com\/strongblog\/","blogrss":"http:\/\/strongloop.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/strongloop-logo.png","logo_width":"150","screenshot":null,"tags":"API Deployment,API Management"}],"published":"07\/23\/2014"}