{"company":[{"id":"8","name":"Layer 7 Technologies","summary":"Layer 7 is a leading provider of API security and governance for Service Oriented, Web Oriented and Cloud Oriented integration. Through our award winning line of SecureSpan and CloudSpan family of API gateways and management products, Layer 7 is helping organizations control how they expose their data and applications to outside divisions, partners, mobile developers and cloud services.\nFounded in","details":"Layer 7 is a leading provider of API security and governance for Service Oriented, Web Oriented and Cloud Oriented integration. Through our award winning line of SecureSpan and CloudSpan family of API gateways and management products, Layer 7 is helping organizations control how they expose their data and applications to outside divisions, partners, mobile developers and cloud services.\nFounded in 2003, Layer 7 operates in the US, Canada and Europe. Our customers include leading insurance, banking, telecom and government organizations. The company is venture backed by leading Canadian and US investors.","website":"http:\/\/apify.heroku.com\/resources","twitter":"https:\/\/twitter.com\/layer7","github":"https:\/\/github.com\/Layer7tech","blog":"http:\/\/www.layer7tech.com\/blogs\/","blogrss":"http:\/\/www.layer7tech.com\/blogs\/index.php\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/layer7-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/6334_apify.png","tags":"API Gateway,API Management,API Management,Layer7"},{"id":"9","name":"Mashape","summary":"Mashape provides tools that enable developers to quickly deliver and consume APIs and offers a marketplace for listing APIs. Mashape provides tools for testing your API, code for generation of custom errors, components for user management and standardized API code language libraries in multiple languages. Once your API is ready for prime time Mashape provides a marketplace for listing your API, le","details":"Mashape provides tools that enable developers to quickly deliver and consume APIs and offers a marketplace for listing APIs. Mashape provides tools for testing your API, code for generation of custom errors, components for user management and standardized API code language libraries in multiple languages. Once your API is ready for prime time Mashape provides a marketplace for listing your API, letting developers to easily discover and begin hacking with your API, in a social API community environment.","website":"http:\/\/www.mashape.com\/","twitter":"https:\/\/twitter.com\/mashape","github":"https:\/\/github.com\/Mashape","blog":"http:\/\/blog.mashape.com\/","blogrss":"http:\/\/feeds.feedburner.com\/MashapesVoice","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/mashape-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Mashape-Screenshot.png","tags":"API Directory,API Discovery,API Integration,API Management,API Operations"},{"id":"1","name":"Mashery","summary":"Masheryis an API management service provider that offers an API as a Software as a Service (SaaS). You can leverage Mashery&rsquo;s platform to get an API planned, deployed, and into operation quickly. Mashery makes a pretty compellingbuy versus build argument when planning for your API.\nMasheryprovides a wide array of tools in three distinct areas:\n\nAPI Managementbuilding blocks like API registra","details":"Masheryis an API management service provider that offers an API as a Software as a Service (SaaS). You can leverage Mashery&rsquo;s platform to get an API planned, deployed, and into operation quickly. Mashery makes a pretty compellingbuy versus build argument when planning for your API.\nMasheryprovides a wide array of tools in three distinct areas:\n\nAPI Managementbuilding blocks like API registration, credential management, usage throttling and business rules.\nMetrics and Reportingbuilding blocks like API usage, developer activity, systems status, and real-time insights into API operations.\nCommunity Managementbuilding blocks for blogs, wiki, general content management, change control, and forums.\n\nMashery is definitely the leader in this space. It has a robust set of API management features as well as a service level agreement and extensive API support portal.\nMashery also understands theAPI developer networkto enable deeper integration of their API services.\nMashery&rsquo;s platform, collective experience, resources, and support makes it enticing to use them as a platform for launching and growing your API.","website":"http:\/\/www.mashery.com","twitter":"https:\/\/twitter.com\/Mashery","github":"https:\/\/github.com\/mashery","blog":"http:\/\/blog.mashery.com\/","blogrss":"http:\/\/blog.mashery.com\/rss.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/mashery-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Mashery-Screenshot.png","tags":"API Management,Delyn Simons,Mashery,Oren Michels"},{"id":"30","name":"WSO2","summary":"WSO2 is the lean enterprise middleware company. It delivers the only complete open source enterprise SOA middleware stack purpose-built as an integrated platform to support today&rsquo;s heterogeneous enterprise environments internally and in the cloud. WSO2&rsquo;s service and support team is led by technical experts who have proven success in deploying enterprise SOAs and contribute to the techn","details":"WSO2 is the lean enterprise middleware company. It delivers the only complete open source enterprise SOA middleware stack purpose-built as an integrated platform to support today&rsquo;s heterogeneous enterprise environments internally and in the cloud. WSO2&rsquo;s service and support team is led by technical experts who have proven success in deploying enterprise SOAs and contribute to the technology standards that enable them.","website":"http:\/\/wso2.com","twitter":"http:\/\/twitter.com\/wso2","github":"https:\/\/github.com\/wso2","blog":"http:\/\/wso2.com\/blogs\/thesource\/","blogrss":"http:\/\/wso2.com\/blogs\/thesource\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/wso2-logo-white-800X360.jpg","screenshot":null,"tags":"API Management,BaaS"},{"id":"3","name":"Apigee","summary":"Apigee's API Platform enables businesses and developers to deliver   well-designed, scalable APIs and apps, drive developer adoption, and   generate business value from their API ecosystem.\nApigeeprovides resources to help you understand best practices, avoid common pitfalls, develop your strategy, and learn to drive your developer community.\nApigeeseems dedicated to a healthy and standards based ","details":"Apigee's API Platform enables businesses and developers to deliver   well-designed, scalable APIs and apps, drive developer adoption, and   generate business value from their API ecosystem.\nApigeeprovides resources to help you understand best practices, avoid common pitfalls, develop your strategy, and learn to drive your developer community.\nApigeeseems dedicated to a healthy and standards based approach to delivering your API ecosystem with pricing for every budget. Their three tiers of pricing allow you to get your API up and running without a huge budget, and grow as the demand for your API grows.\nApigee also provides articles, white papers, and other resources to help you deliver your API.","website":"http:\/\/developer.apigee.com\/","twitter":"https:\/\/twitter.com\/Apigee","github":"https:\/\/github.com\/apigee","blog":"http:\/\/blog.apigee.com\/","blogrss":"http:\/\/feeds.apigee.com\/ApigeeBlog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/apigee-logo.gif","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/3341_apigee_oauth.png","tags":"API Gateway,API Management,API Management,Apigee,Authentication,JSON,REST,Security,Utility"},{"id":"11","name":"Alcatel-Lucent","summary":"Become the Platform\nThe market for applications is growing exponentially and the time for service providers, enterprises and developers to capitalize on new revenues is now.\nInnovative mobile applications that leverage the benefits of the network can give service providers a powerful way to attract and retain subscribers &mdash; helping to generate additional income and provide a competitive edge.","details":"Become the Platform\nThe market for applications is growing exponentially and the time for service providers, enterprises and developers to capitalize on new revenues is now.\nInnovative mobile applications that leverage the benefits of the network can give service providers a powerful way to attract and retain subscribers &mdash; helping to generate additional income and provide a competitive edge. And the opportunity to extend beyond mobile to IPTV, web-based apps, multi-screen, enterprise services etc., offers an even greater opportunity to grow revenue and attract and retain subscribers.\nHowever, the complexity of today's communication and content industries present major obstacles to the creation of new applications. Developers are faced with thousands of devices, hundreds of service providers with varying technical requirements and a rapidly growing community of app stores. In this highly fragmented environment, developers are forced to make tough choices that limit which devices an application can run on, which functions can be provided and which service providers will be targeted.\nUltimately this reduces the market reach and revenue potential that applications can generate for developers, as well as service providers and enterprises, while at the same time seriously limiting choice and flexibility for consumers everywhere.\nService providers, enterprises and application developers alike have an immediate opportunity to reverse the tired, traditional model; leveraging the network as the platform to incite unforeseen levels of collaboration, openness and innovation in our industry.\nThe Open API Platform offers unique value to both service providers and enterprises interested in innovating on existing assets and establishing a deeper relationship with the developer community.\nFrom Enterprises to Service Providers\nThe Open API Platform allows service providers to expand their position in the value chain and move beyond the role of \"connection provider.\" Enterprises gain insight into how to best leverage their existing assets and expose them to developer communities in order to stimulate innovation and expand the reach of their brand.\nWith the Alcatel-Lucent Open API Platform, service providers and enterprises gain a simple framework for exposing their key assets and managing their own developer communities. The Open API Platform enables service providers and enterprises to:\n\nExpose their APIs in the form of REST APIs to make them more easily and widely used by the developer community\nCreate their own developer programs or supplement their existing ecosystem of developers, content providers and third-party API providers\nCollaborate with developers to deliver services that attract and retain subscribers\nEarn additional revenue from existing assets. For service providers, these could be network assets such as context and location information, QoS, device and subscriber information, and more. For enterprises, this could be a variety of assets based on the specific industry being served. In retail for example, an extensive product catalog and library might serve as an asset to leverage.\n\nFor Developers\nThe Alcatel-Lucent Open API Platform provides tools that allow developers to collaborate, build, test and distribute new applications for service provider networks. It provides open access to network-based APIs, third party APIs and Alcatel-Lucent APIs (like the new Multi-screen Foundation APIs) to help stimulate the development of new applications that take full advantage of what the network can offer.\nFurthermore, our platform provides the critical business tools developers need to manage applications throughout their lifecycle. Our approach helps developers expand the audience for their applications &mdash; reaching more service providers, more end users and more devices, with less time, effort and cost.\nExpanding the Ecosystem\nIn June 2010, Alcatel-Lucent acquired ProgrammableWeb, the technology industry's universal source for Web APIs used by application developers to build web, mobile, and other connected applications that serve consumers and the workplace. One month later, in July of 2010, Alcatel-Lucent also acquired OpenPlug, a mobile software and development tools provider. The acquisition of OpenPlug allowed Alcatel-Lucent to deepen its tole in the applications space by delivering, as part of an integrated suite of developer tools, a platform where application developers can write an application once, which will then be translated to run on any of the five major mobile operating systems.\nAlcatel-Lucent's aquisition of these companies helps bring together an ecosystem of service providers, enterprises, and developers to drive the creation of unique applications today and in the new world of broadband mobile through LTE.","website":"http:\/\/openapiservice.com\/","twitter":"https:\/\/twitter.com\/Alcatel_Lucent","github":"","blog":"http:\/\/www2.alcatel-lucent.com\/blogs\/corporate\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/alcatel-lucent-logo.jpg","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Alcatel-Lucent-Screenshot.png","tags":"API Management,Financial,Retail,Service provider,Telco"},{"id":"90","name":"APISpark","summary":"APISpark is an cloud API platform that lets you create, host, manage and use web APIs. Using the Restlet Framework at its core, APISpark simplifies the web API experience, the time to market, and the overall cost to get started and to scale you APIs. Restlet is a web API platform vendor, pioneer of RESTful web APIs. APISpark serves our customers around the world, providing software to build web AP","details":"APISpark is an cloud API platform that lets you create, host, manage and use web APIs. Using the Restlet Framework at its core, APISpark simplifies the web API experience, the time to market, and the overall cost to get started and to scale you APIs. Restlet is a web API platform vendor, pioneer of RESTful web APIs. APISpark serves our customers around the world, providing software to build web APIs, which includes APISpark, the PaaS version of Restlet. APISpark lets you build and deploy your web APIs, which includes the creation, hosting and management--all in one solution.APISpark also provides marketing services for APIs that demonstrate they are stable and well document by promoting via their own API catalog. The entire catalog is curated, to ensure quality.","website":"http:\/\/apispark.com\/","twitter":"https:\/\/twitter.com\/restlet_org","github":"https:\/\/github.com\/apispark","blog":"http:\/\/blog.restlet.com\/","blogrss":"http:\/\/blog.restlet.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/APISpark-Logo.png","screenshot":null,"tags":"API Deployment,API Management,API-Deployment"},{"id":"1688","name":"Storeplacer","summary":"Storeplacer&trade; is an SaaS commerce platform that provides   developers and retailers with multi-channel commerce tools   to engage, analyze and transact with customers anytime on any digital   device.\nStoreplacer provides developers with a powerful API suite, an scalable database and cloud-based tools to create, manage and embed product content and transactions within any digital touchpoint. D","details":"Storeplacer&trade; is an SaaS commerce platform that provides   developers and retailers with multi-channel commerce tools   to engage, analyze and transact with customers anytime on any digital   device.\nStoreplacer provides developers with a powerful API suite, an scalable database and cloud-based tools to create, manage and embed product content and transactions within any digital touchpoint. Developers can use a single backend to easily create omni-channel commerce experiences across web, mobile, iOS, Android, TV, social networks, blog, videos, email, ads, voice apps or other connected devices.\nStoreplacer&rsquo;s Multi-Channel Commerce Cloud enables merchants,  agencies, and non-technical managers to create and deploy web, mobile  web, and social commerce stores without any IT staff required. Clients  can deploy stores in a single day without having to write a single line  of code and never have to configure or maintain servers. Merchants&rsquo; can  now focus on customer acquisition, merchandising and the user experience  and spend less time on IT complexities.","website":"http:\/\/www.storeplacer.com\/","twitter":"https:\/\/twitter.com\/storeplacer","github":"https:\/\/github.com\/Storeplacer","blog":"http:\/\/www.storeplacer.com\/company\/blog\/","blogrss":"http:\/\/blog.storeplacer.com\/CMS\/UI\/Modules\/BizBlogger\/rss.aspx","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/store-placer-logo.jpeg","screenshot":null,"tags":"API Management,API-Deployment,BaaS,E-commerce"},{"id":"31","name":"APIphany","summary":"Beyond the typical API Management Platform, Apiphany offers a true Global API Delivery Platform to their customers. Geared to fit into existing enterprise infrastructure, Apiphany&rsquo;s team has developed a scalable, flexible cloud-based solution to help companies succeed with their API strategy. This means Apiphany helps organizations launch, control, and scale their API to meet their evolving ","details":"Beyond the typical API Management Platform, Apiphany offers a true Global API Delivery Platform to their customers. Geared to fit into existing enterprise infrastructure, Apiphany&rsquo;s team has developed a scalable, flexible cloud-based solution to help companies succeed with their API strategy. This means Apiphany helps organizations launch, control, and scale their API to meet their evolving needs as well as helps them monitor their API performance and gain insight in their API ecosystem. And finally, Apiphany Global API Delivery Platform supports clients&rsquo; efforts to drive developer adoption and build community for their API.","website":"http:\/\/apiphany.com\/features","twitter":"https:\/\/twitter.com\/APIphany","github":"https:\/\/github.com\/apiphany","blog":"http:\/\/apiphany.com\/blog#.UP46daFdfB8","blogrss":"http:\/\/apiphany.com\/rss?containerid=33","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/apiphany-logo-blue.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/6443_apiphany.png","tags":"API Management"},{"id":"21","name":"Vordel","summary":"Vordel was born out of a recognition by our founders of the increasingly open and de-perimeterized nature of corporate computing environments. Driven by the adoption of technologies such as XML, REST and SOAP, Vordel identified the need for a means of controlling the increasingly complex and inherently insecure nature of connections across the internet between enterprises. In response Vordel devel","details":"Vordel was born out of a recognition by our founders of the increasingly open and de-perimeterized nature of corporate computing environments. Driven by the adoption of technologies such as XML, REST and SOAP, Vordel identified the need for a means of controlling the increasingly complex and inherently insecure nature of connections across the internet between enterprises. In response Vordel developed the world&rsquo;s first XML firewall in 2002, the precursor to today&rsquo;s XML Gateway or SOA appliance.\nToday, the company&rsquo;s technology is in its sixth generation and is deployed in some of the world&rsquo;s largest IT infrastructures. Fortune 500 enterprises and government agencies around the world rely on Vordel's XML Gateway and Cloud Service Broker to increase performance, strengthen security and enhance the interoperability of their SOA and Cloud deployments. With Vordel, companies accelerate their time to benefit from SOA and Cloud and reduce the attendant development and deployment costs. Vordel enables enterprises to govern their service usage and reduce the costs associated with protecting and accelerating their services-based IT environments.","website":"http:\/\/www.vordel.com\/","twitter":"https:\/\/twitter.com\/vordel","github":"","blog":"http:\/\/resources.vordel.com\/index.php\/category\/blog\/","blogrss":"view-source:http:\/\/feeds.feedburner.com\/Vordelfeeds?format=xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Vordel-API-Management.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Vordel-Screenshot.png","tags":"API Deployment,API Gateway,API Management,Enterprise,Vordel"},{"id":"4","name":"3Scale","summary":"3Scaleprovides plug-and-play as well as enterprise level API management services. 3Scale is similar to3Scaleconnect is a starter platform with a freemium model for delivering your API. You can deploy at no cost, and pay-as-you-go based upon the volume of calls made on your API. This model is well suited to those who are not sure of their API business model or target audience &mdash; or are just lo","details":"3Scaleprovides plug-and-play as well as enterprise level API management services. 3Scale is similar to3Scaleconnect is a starter platform with a freemium model for delivering your API. You can deploy at no cost, and pay-as-you-go based upon the volume of calls made on your API. This model is well suited to those who are not sure of their API business model or target audience &mdash; or are just looking to test the waters.","website":"https:\/\/support.3scale.net\/reference\/activedocs#\/service_management_api","twitter":"","github":"https:\/\/github.com\/3scale","blog":"http:\/\/www.3scale.net\/support\/tech-blog\/","blogrss":"http:\/\/www.3scale.net\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/3scale-logo.jpg","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/3287_3scale_service_management.png","tags":"3Scale,Administration,Administration,Administration,Analytics,Analytics,Analytics,API Management,API Management,API Management,API Management,API Management,API Management,API Management,API Management,API Management,API Management,API Management,API Management,API Management,Billing,Billing,Billing,Financial,Financial,Financial,internet,internet,internet,internet,internet,internet,internet,internet,internet,internet,internet,internet,Open source,REST,REST,REST,REST,REST,REST,REST,REST,REST,REST,REST,REST,Tools,Tools,Tools,Tools,Tools,Tools,Tools,Tools,Tools,Tools,Tools,Tools"},{"id":"27","name":"Nevatech Sentinet","summary":"Nevatech Sentinet&trade; is a flexible, lightweight and scalable API management platform that promotes integration through the use of SOA standards. It is designed to connect, mediate, and manage interactions between services across the enterprise or in the cloud. If your organization uses internally or externally-facing web services and APIs, cloud-based infrastructure, or service-oriented archit","details":"Nevatech Sentinet&trade; is a flexible, lightweight and scalable API management platform that promotes integration through the use of SOA standards. It is designed to connect, mediate, and manage interactions between services across the enterprise or in the cloud. If your organization uses internally or externally-facing web services and APIs, cloud-based infrastructure, or service-oriented architecture for your applications, then you will find Sentinet to be a powerful tool, which can be deployed rapidly, and immediately start delivering tangible results.","website":"http:\/\/www.nevatech.com\/","twitter":"https:\/\/twitter.com\/nevatechinc","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Nevatech-Logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Nevatech-Screenshot.png","tags":"API Management"},{"id":"28","name":"Emergent One","summary":"Emergent One is an API platform that allows you to quickly generate and launch a new API from MySQL or Postegres database connections. After launched a developer portal is providing API registration, documentation, blog and console. Emergent One automatically generates documentation and code samples, and provides access controls, caching and analytics for managing your API.Emergent one is a comple","details":"Emergent One is an API platform that allows you to quickly generate and launch a new API from MySQL or Postegres database connections. After launched a developer portal is providing API registration, documentation, blog and console. Emergent One automatically generates documentation and code samples, and provides access controls, caching and analytics for managing your API.Emergent one is a complete cloud solution for taking existing data and deploying, then managing the APIs without any addition deployment of software. The Emergent One platform provides a free tier to test drive the cloud API platform, with scale business and enterprise solutions for database to API deployments.","website":"http:\/\/www.emergentone.com\/","twitter":"https:\/\/twitter.com\/emergent_one","github":"","blog":"http:\/\/www.emergentone.com\/blog\/company\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/emergent-one-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/EmergentOne-Screenshot.png","tags":"API Deployment,API Management,API-Deployment"},{"id":"25","name":"Apify","summary":"Apify is a small and powerful open source library that delivers new levels of developer productivity by simplifying the creation of RESTful architectures. It helps development teams deliver quality web services and applications in reduced amounts of time. Web services are a great way to extend your application, however, adding a web API to an existing web application can be a tedious and time-cons","details":"Apify is a small and powerful open source library that delivers new levels of developer productivity by simplifying the creation of RESTful architectures. It helps development teams deliver quality web services and applications in reduced amounts of time. Web services are a great way to extend your application, however, adding a web API to an existing web application can be a tedious and time-consuming task. Apify takes certain common patterns found in most web services and abstract them so that you can quickly write web APIs without having to write too much code.\nAPIfy aims to help organizations open up APIs to developer communities, in a fast, simple and secure way. APIs promise to help organizations drive new revenue and reach across mobile and cloud. They can also make organizations more responsive to changing customer needs by giving them the data and application access they need, when they need it.\nBut understanding best practices for opening up APIs to outside communities can be daunting. APIfy distils the lessons from over 10 years of experience gained at Layer 7 Technologies into a simple-to-configure, all-cloud API Management-as-a-Service offering.\n","website":"http:\/\/www.apify.co\/","twitter":"https:\/\/twitter.com\/api_fy","github":"https:\/\/github.com\/apify","blog":"http:\/\/www.apify.co\/blog\/","blogrss":"http:\/\/www.apify.co\/blog\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/apify-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Apify-Screenshot.png","tags":"API Management"},{"id":"82","name":"API Engine","summary":"API Engine is an advanced collaborative API document construction and distribution platform that includes free unlimited public APIs as standard with every account and offers competitive packages for teams and private APIs.","details":"API Engine is an advanced collaborative API document construction and distribution platform that includes free unlimited public APIs as standard with every account and offers competitive packages for teams and private APIs.","website":"https:\/\/apiengine.io\/","twitter":"","github":"https:\/\/github.com\/apiengine","blog":"","blogrss":"http:\/\/apiengine.io\/site.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/API-Engine.png","screenshot":null,"tags":"API Management"},{"id":"20","name":"SOA Software","summary":"SOA Software, Inc. provides API management and integrated service-oriented architecture (SOA) governance automation solutions. It offers Enterprise API Management; Policy Manager, which provides SOA registry\/repository and SOA policy governance solutions; Repository Manager, which provides software development asset repository, lifecycle management, and metadata federation solutions; and Portfolio","details":"SOA Software, Inc. provides API management and integrated service-oriented architecture (SOA) governance automation solutions. It offers Enterprise API Management; Policy Manager, which provides SOA registry\/repository and SOA policy governance solutions; Repository Manager, which provides software development asset repository, lifecycle management, and metadata federation solutions; and Portfolio Manager, a planning governance product that helps ensure the alignment of SOA programs with strategic IT investment and business objectives. The company also provides Service Manager, a SOA management and security product, which provides security, routing, mediation, monitoring, and management for SOA and Web services; and SOLA, which provides a governable mainframe SOA platform.","website":"http:\/\/www.soa.com\/","twitter":"https:\/\/twitter.com\/SOASoftwareInc","github":"","blog":"http:\/\/blog.soa.com\/","blogrss":"http:\/\/feeds.feedburner.com\/SOA\/Blog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/soa-software-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Atmosphere-Screenshot.png","tags":"API Gateway,API Management,Enterprise,SOA Software"},{"id":"91","name":"Exicon","summary":"Exicon is the AppCycle management company that simplifies the creation, deployment and management of mobile applications for some of the world's biggest companies allowing them to accelerate their success in mobile.\nThrough its proprietary AppCycle Management platform, Exicon provides the services and tools to support customers in defining their application needs, finding the best developers, stor","details":"Exicon is the AppCycle management company that simplifies the creation, deployment and management of mobile applications for some of the world's biggest companies allowing them to accelerate their success in mobile.\nThrough its proprietary AppCycle Management platform, Exicon provides the services and tools to support customers in defining their application needs, finding the best developers, storing all components of the applications, reaching the end users for your application and measuring its performance.","website":"http:\/\/www.exicon.mobi\/","twitter":"","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/exicon-logo.png","screenshot":null,"tags":"API Management,Application Management"},{"id":"1361","name":"SlashDB","summary":"SlashDB connects your internal databases and constructs a REST\/HTTP web service, easily making database content accessible by URLs for getting, updating, inserting and deleting in a secure way. SlashDB provides connectors for Microsoft SQL Server, Oracle, MySQL, PostGreSQL, IBM DB2 and Sybase--covering the top 5 databases you will find in the enterprise or small to medium businesses.\nSlashDB autom","details":"SlashDB connects your internal databases and constructs a REST\/HTTP web service, easily making database content accessible by URLs for getting, updating, inserting and deleting in a secure way. SlashDB provides connectors for Microsoft SQL Server, Oracle, MySQL, PostGreSQL, IBM DB2 and Sybase--covering the top 5 databases you will find in the enterprise or small to medium businesses.\nSlashDB automatically turns databases into online resource so their  content becomes accessible to authorized web, mobile and enterprise  applications for reading and writing under standard data formats.  Technically speaking, it makes REST APIs out of relational databases.SlashDB  is currently available for both on-premise and cloud installations, providing ready-to-use virtual machines (AMI, VMware, VirtualBox etc.). Once a VM is launched a  user-friendly, web based admin GUI allows to add, remove and reconfigure  database services.","website":"http:\/\/www.slashdb.com\/","twitter":"http:\/\/twitter.com\/slash_db","github":"","blog":"","blogrss":"http:\/\/www.slashdb.com\/feed\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/slashdb-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/7335_slashdb.png","tags":"API Management,API-Deployment"},{"id":"1784","name":"IBM","summary":"IBM&reg; API Management solution provides a complete set of web API capabilities to help you extend services from the back-office to new front-office engagements. It offers flexible deployment options, including capabilities for creating, proxying, assembling, securing, and scaling web APIs. IBM API Management provides detailed analytics and operational metrics to the business owner, as well as a ","details":"IBM&reg; API Management solution provides a complete set of web API capabilities to help you extend services from the back-office to new front-office engagements. It offers flexible deployment options, including capabilities for creating, proxying, assembling, securing, and scaling web APIs. IBM API Management provides detailed analytics and operational metrics to the business owner, as well as a customized developer portal for socializing the APIs and managing applications that can be used by developers.","website":"http:\/\/www-03.ibm.com\/software\/products\/us\/en\/api-management\/","twitter":"","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/bw-ibm-logo.jpeg","screenshot":null,"tags":"API Management"},{"id":"1813","name":"Oracle","summary":"Secures service-oriented architecture (SOA) deployments on-premise, across domain boundaries, or in the cloud enabling organizations to securely and rapidly adopt cloud, mobile, and SOA services. Provides a lightweight API gateway for securing and managing APIs. Connects mobile devices to existing enterprise systems. Significantly lowers integration costs, decreases total cost of ownership, and re","details":"Secures service-oriented architecture (SOA) deployments on-premise, across domain boundaries, or in the cloud enabling organizations to securely and rapidly adopt cloud, mobile, and SOA services. Provides a lightweight API gateway for securing and managing APIs. Connects mobile devices to existing enterprise systems. Significantly lowers integration costs, decreases total cost of ownership, and reduces deployment risks. Offers rich integration with many identity and access management platforms. Helps streamline regulatory compliance through authentication, authorization, and audit capabilities.","website":"http:\/\/www.oracle.com\/us\/products\/middleware\/identity-management\/api-gateway\/overview\/index.html","twitter":"https:\/\/twitter.com\/OracleSOA","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/oracle-logo.jpg","screenshot":null,"tags":"API Deployment,API Gateway,API Management"}],"published":"06\/29\/2013"}